{
    "name": "Traveloka",
    "shortDescription": "An online booking app providing reliable, and all-in-one solutions for travelers and adventurers.",
    "overview": "Traveloka aims a <b> comprehensive platform </b> that provides a wide range of <b> travel services </b> including booking flights, hotels, and other travel-related products. Its primary goal is to <b>simplify the process of travel planning</b> and booking by offering a <b> one-stop solution </b> for all travel needs. ",
    "refinedScope": "I redesigned the <b>logo</b> and <b>website</b> to align with Traveloka's brand identity, aiming to create a fresh and <b>captivating</b> look. My goal was to introduce a new level of innovation to the brand while enhancing <b>user engagement</b>, offering a more <b>visually appealing</b> and <b>user-friendly</b> experience.",
    "roles": ["UX/UI Designer", "Visual Designer"],
    "timeline": ["Design 5+ weeks"],
    "tools": [
        "Figma"
    ],
    "process": ["Discovery", "Ideation", "Design", "Relection"],
    "platform": ["Website"],
    "sections": {
        "discovery": {
            "id": "discovery",
            "title": "Discovery",
            "heuristic": {
                "title": "Heuristic Evaluation",
                "description": "Before I redesigned the logo and the website, I went for hands-on experience to try out the website myself as first-time users. A few notes into heuristics are:",
                "feedback": [
                    "Traveloka’s logo is simple and the bird symbol is effective, but some users unfamiliar with the brand might not immediately associate it with travel.",
                    "The website’s layout is clean and easy to navigate, but the color scheme could be more visually appealing.",
                    "Consistency and Standards: the components are consistent but too crowded and the text too small, making it difficult to read on the main content."
                ]
            },
            "brandIdentity": {
                "title": "Brand Identity Prism",
                "description": "I conducted a competitive analysis to understand the brand's competitors and identify Traveloka's unique selling points. I also analyzed the brand's current logo and website to identify areas for improvement and align the brand's visual identity with its core values and objectives."
            },
            "competitiveAnalysis": {
                "title": "Competitive Analysis",
                "description": "I conducted a competitive analysis to understand the brand's competitors and identify Traveloka's unique selling points. I also analyzed the brand's current logo and website to identify areas for improvement and align the brand's visual identity with its core values and objectives."
            }
        },
        "ideation": {
            "id": "ideation",
            "title": "Ideation",
            "personas": {
                "title": "Persona",
                "description": "After grouping similar responses from the survey and meeting with the client to discuss why ILUVUS was created. Our team focused on two main user groups: professional users and regular users. Our insights gathered from research led to the creation of the following personas with our user-centered approach."
            },
            "dynamic": {
                "title": "Dynamic Diagram",
                "description": "We also created a dynamic diagram to illustrate the step-by-step process of creating a new community, a main feature available exclusively to professional users. The diagram highlights the interactions between the user interface, controller, and database, understanding the app's flow and how users would interact with the app."
            }
        },
        "design": {
            "id": "design",
            "title": "Design",
            "styleGuide": {
                "title": "Style Guide",
                "description": "As a designer in the team, I worked on the mood board to gather unique ideas and optimize a color palette through a style guide that authentically represents the core value of celebrating LGBTQ+ individuals and diverse communities. I wanted to make the calm and supportive UI to evoke the desired emotions and create a compelling user experience aligned with the brand's values and objectives."
            },
            "sketches": {
                "title": "Sketches & Wireframe",
                "description": "We created sketches to visualize the app's layout and features. I made low-fidelity wireframes for 3-4 other screens based on the main user flow.  We used these sketches to discuss the app's flow and functionality with the client and team members. "
            }
        },
        "development": {
            "id": "development",
            "title": "Development",
            "prototype": {
                "title": "Prototype",
                "description": "I created a high-fidelity prototype to demonstrate the app's functionality and user flow. The prototype was used to test the app's usability and gather feedback from the client and potential users.",
                "src": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Fproto%2F69hpY77FJXsQwIhoRzQVNe%2FILUVUS-on-iOS%3Fnode-id%3D2972-1717%26t%3DvQFmbzQkldB9iIGn-1%26scaling%3Dscale-down%26content-scaling%3Dfixed%26page-id%3D2303%253A6898%26starting-point-node-id%3D2972%253A1717%26show-proto-sidebar%3D1"
            },
            "heuristic": {
                "title": "Heuristic Evaluation",
                "description": "After we conducted a heuristic evaluation, the prototype needed a little adjustment to enhance the usability and user experience of the system and make it more user-friendly.",
                "feedback": [
                    "“However, some buttons were <b>difficult</b> to initially find. For example, the “Add Post” button was not seen during the first to attempt to complete the first task. ”",
                    "“ The aesthetic of the app is <b>intuitive</b>, and <b>realistic</b>, coinciding with real-world social media applications the white, purple, and soft yellow accents work well together, creating a <b>clean</b>, and <b>welcoming</b> social media platform. ”",
                    "“ In most cases, <b>user control</b> and <b>freedom</b> were implemented well. There were multiple cases in which mistakes and incorrect navigation could be reversed easily.  ”"
                ]
            },
            "final": {
                "title": "Final Product",
                "description": " After working with my team, the final product was developed using React Native, with backend features in Java SpringBoot and a user-friendly interface designed with Tailwind CSS. The app was launched on both iOS and Android platforms. Feel free to explore the app and see the features we developed."
            }
            
        },
        "reflection": {
            "id": "reflection",
            "title": "Reflection",
            "lookingback": {
                "title": "Looking Back.",
                "description": "In a 2-week design & a 5-week sprint:",
                "list": [
                    "I designed a <b>style guide</b> and <b>wireframes</b>",
                    "I produced a <b>high-fidelity prototype</b>",
                    "We conducted <b>30 team meetings</b>",
                    "We developed the app on both <b>iOS</b> and <b>Android</b> platforms"
                ],
                "reflection": "I am proud of the work we accomplished. We were able to create a unique social media platform that start from scratch. This is my first time using React Native to build the front-end to integrate with the backend StringBoot. It was challenging, but the learning curve was rewarding as I gained a deeper understanding of how these technologies work together to create a seamless user experience. I am grateful for the opportunity to work on this project and collaborate with my team to bring the client's vision to life."
            },
            "lookingforward": {
                "title": "Looking Forward.",
                "description": "At the moment, we already hand off to the project to client and I hope to see ILUVUS grow and expand its scope. Through this group project, I learned to always learn. "
            },
            "demo": {
                "title": "Demo",
                "description": "Expo day for demo the app to the client and potential users."
            }

        }
    }
}
