{
    "name": "ILUVUS",
    "shortDescription": "A social media platform provide a unique user experience that celebrates diversity.",
    "overview": "ILUVUS was inspired to develop <b>a social mobile app</b> dedicated to posting categorical content, commenting, and <b>celebrating the achievements</b>, and stories of <b>LGBTQ individuals</b> and <b>diverse communities</b>.",
    "refinedScope": "Our focus to create a space that <b>prioritizes</b> these communities' accomplishments, offering a <b>unique user experience</b> while ensuring a safe and positive environment.",
    "roles": ["UX Designer", "UI Designer", "Front End Developer"],
    "timeline": ["3 week sprint", "Research 3+ weeks", "Design 4+ weeks"],
    "tools": [
        "Figma",
        "React Native",
        "MongoDB",
        "Spring Boot",
        "Cloud Firestore"
    ],
    "process": ["Discovery", "Ideation", "Design", "Development", "Relection"],
    "platform": ["iOS", "Android"],
    "sections": {
        "discovery": {
            "id": "discovery",
            "title": "Discovery",
            "clientResearch": {
                "title": "Client Research",
                "description": "After meetings with our client, our team thoroughly discuss the users' needs, along with the vision that the client had for this project. We learned we need to identify what matters most to our users. Do they prioritize diversity, user-friendliness, content quality, or something else? This question will help us to polish the application’s user experience to align with their preferences."
            },
            "userResearch": {
                "title": "User Research",
                "description": "We conducted a user interview and survey to understand the users' needs, preferences, and pain points. The research findings we collected from the compilation of the survey revealed that our users want a platform that prioritizes a user-friendly interface, effective content moderation, and robust privacy settings, offers a unique user experience, and ensures a safe and positive environment."
            }
            
        },
        "ideation": {
            "id": "ideation",
            "title": "Ideation",
            "personas": {
                "title": "Persona",
                "description": "After grouping similar responses from the survey and meeting with the client to discuss why ILUVUS was created. Our team focused on two main user groups: professional users and regular users. Our insights gathered from research led to the creation of the following personas with our user-centered approach."
            },
            "dynamic": {
                "title": "Dynamic Diagram",
                "description": "We also created a dynamic diagram to illustrate the step-by-step process of creating a new community, a main feature available exclusively to professional users. The diagram highlights the interactions between the user interface, controller, and database, understanding the app's flow and how users would interact with the app."
            }
        },
        "design": {
            "id": "design",
            "title": "Design",
            "styleGuide": {
                "title": "Style Guide",
                "description": "As a designer in the team, I worked on the mood board to gather unique ideas and optimize a color palette through a style guide that authentically represents the core value of celebrating LGBTQ+ individuals and diverse communities. I wanted to make the calm and supportive UI to evoke the desired emotions and create a compelling user experience aligned with the brand's values and objectives."
            },
            "sketches": {
                "title": "Sketches & Wireframe",
                "description": "We created sketches to visualize the app's layout and features. I made low-fidelity wireframes for 3-4 other screens based on the main user flow.  We used these sketches to discuss the app's flow and functionality with the client and team members. "
            }
        },
        "development": {
            "id": "development",
            "title": "Development",
            "prototype": {
                "title": "Prototype",
                "description": "I created a high-fidelity prototype to demonstrate the app's functionality and user flow. The prototype was used to test the app's usability and gather feedback from the client and potential users.",
                "src": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Fproto%2F69hpY77FJXsQwIhoRzQVNe%2FILUVUS-on-iOS%3Fnode-id%3D2972-1717%26t%3DvQFmbzQkldB9iIGn-1%26scaling%3Dscale-down%26content-scaling%3Dfixed%26page-id%3D2303%253A6898%26starting-point-node-id%3D2972%253A1717%26show-proto-sidebar%3D1"
            },
            "heuristic": {
                "title": "Heuristic Evaluation",
                "description": "After we conducted a heuristic evaluation, the prototype needed a little adjustment to enhance the usability and user experience of the system and make it more user-friendly.",
                "feedback": [
                    "However, some buttons were <b>difficult</b> to initially find. For example, the “Add Post” button was not seen during the first to attempt to complete the first task. ”",
                    "“ The aesthetic of the app is <b>intuitive</b>, and <b>realistic</b>, coinciding with real-world social media applications the white, purple, and soft yellow accents work well together, creating a <b>clean</b>, and <b>welcoming</b> social media platform. ”",
                    "“ In most cases, <b>user control</b> and <b>freedom</b> were implemented well. There were multiple cases in which mistakes and incorrect navigation could be reversed easily.  ”"
                ]
            },
            "final": {
                "title": "Final Product",
                "description": " After working with my team, the final product was developed using React Native, with backend features in Java SpringBoot and a user-friendly interface designed with Tailwind CSS. The app was launched on both iOS and Android platforms. Feel free to explore the app and see the features we developed."
            }
            
        },
        "reflection": {
            "id": "reflection",
            "title": "Reflection",
            "lookingback": {
                "title": "Looking Back",
                "description": "Looking back at the project, I am proud of the work we accomplished. We were able to create a unique social media platform that celebrates diversity and prioritizes the achievements and stories of LGBTQ individuals and diverse communities. I am proud of the user-centered approach we took throughout the project, ensuring that the app's design and functionality align with the users' needs and preferences."
            },
            "lookingforward": {
                "title": "Looking Forward",
                "description": "Looking forward, I hope to see ILUVUS grow and expand its user base. I believe that the app has the potential to make a positive impact on the LGBTQ community and diverse communities by providing a safe and supportive space to share their stories and celebrate their achievements. I am excited to see how the app evolves and grows in the future."

            },
            "demo": {
                "title": "Demo",
                "description": "Expo day for demo the app to the client and potential users."
            }

        }
    }
}
