{
    "name": "Campfy",
    "shortDescription": "An app for buying all types of camping supplies, prioritizing a fast and convenient shopping experience.",
    "overview": "Camping is a popular outdoor activity that requires specialized gear and equipment. However, finding camping supplies can be time-consuming and frustrating, especially for beginners. Many existing platforms have <b>complex navigation </b>, <b>overwhelming product selections </b>, and <b>lack personalized recommendations</b>, making it difficult for users to find what they need quickly. This often leads to decision fatigue and a less enjoyable shopping experience.",
    "refinedScope": "Campfy is an e-commerce platform designed to streamline the process of purchasing camping supplies. It features a <b> Suggestive flow </b> with curated gear packages to reduce decision fatigue, a powerful product <b> Compare tool</b> for fast evaluation, and a simplified, <b>three-step </b> checkout. Campfy ensures users can quickly acquire necessary supplies through an <b>intuitive </b> and <b>accessible </b> interface.",
    "roles": ["UX Designer", "UI Designer"],
    "timeline": ["On-going"],
    "tools": ["Figma"],
    "process": ["Discovery", "Ideation", "Design"],
    "platform": ["iOS", "Android"],
    "sections": {
        "discovery": {
            "id": "discovery",
            "title": "Discovery",
            "goalStatement": {
                "title": "Goal Statement",
                "description": "Our camping supply app will let users browse and discover essential gear through organized categories and utilize the compare feature to save time on research. This will specifically affect new campers who need to find essential gear for a trip. We will measure effectiveness by tracking first-time users when they sign up."
            },
            "userStory": {
                "title": "User Story",
                "description": "To better understand the needs and pain points of our target users, I created a user story that outlines the typical experience of someone looking to buy camping supplies. This user story helped me empathize with the users and identify key areas where our app can provide value. By focusing on the user's journey, I was able to design features that address their specific needs and enhance their overall shopping experience."
            },
            "competitiveAnalysis": {
                "title": "Competitive Analysis",
                "description": "I conducted a competitive analysis of existing camping supply platforms to identify strengths, weaknesses, and opportunities for improvement. This analysis helped me understand the current market landscape and informed the design decisions for our app. By evaluating competitors, I was able to identify gaps in the market and develop features that differentiate our app from others."
            },
            "userJourney": {
                "title": "User Journey",
                "description": "I mapped out the user journey to visualize the steps users take when interacting with our app. This journey map helped me identify pain points and opportunities for improvement at each stage of the user's experience. By understanding the user journey, I was able to design features that enhance usability and provide a seamless shopping experience."
            },
            "Userpersonas": {
                "title": "User Persona",
                "description": "Based on user research, I developed three user personas to represent the target audience for Campfy. A newbie camper who is new to camping and needs guidance on essential gear and equipment, an adventure mom on the go who wants to plan fun activities for her family, and an experienced camper who values convenience and efficiency when purchasing camping supplies.  These personas are looking for an app that can provide a streamlined shopping experience with personalized recommendations based on their camping needs."
            }

        },
        "ideation": {
            "id": "ideation",
            "title": "Ideation",
            "Brainstorming": {
                "title": "Brainstorming",
                "src": "https://embed.figma.com/board/MtwH8eQAY4zMhinynSt9j4/Google-Project?node-id=0-1&embed-host=share",
                "description": 
                    "During the brainstorming phase, I generated <b>a wide range of ideas </b>for features and functionalities that could enhance the user experience of our camping supply app. I focused on creating solutions that address the pain points identified in the discovery phase, such as simplifying slow navigation and complex checkout processes, while integrating guidance to combat the feeling of being overwhelmed by choices."
            },
            "siteMap": {
                "title": "Site Map",
                "description": "I created a site map to outline the structure and organization of our camping supply app. This site map shows the four main categories: Suggestive, Shop, User, and Cart. Each category contains subcategories that help users navigate the app and find the products they need quickly. The site map also highlights key features such as the Compare tool and streamlined checkout process, which are designed to enhance the user experience and make shopping for camping supplies more efficient."
            },
            "userFlow": {
                "title": "User Flow",
                "description": "I developed user flows to visualize the steps users take when interacting with our camping supply app. These flows helped me identify key touchpoints and interactions that are critical to the user experience. By mapping out the user flows, I was able to design features that enhance usability and provide a seamless shopping experience."
            }
        },
        "design": {
            "id": "design",
            "title": "Design",
            "styleGuide": {
                "title": "Style Guide",
                "description": "The Campfy Style Guide establishes a visual identity based on natural, earthy tones (Dark Olive, Pale Green, Taupe) to evoke stability and comfort, reflecting the brand's goal of making camping preparation easy and stress-free. The logo prominently features two stylized mountains to anchor the brand in the outdoors, while the use of the Poppins and Afacad typefaces ensures both a clear brand presence and high readability for all product information."
            },
            "Digital Wireframe": {
                "title": "Digital Wireframe",
                "description": "After creating paper wireframes, I developed digital wireframes to provide a more detailed representation of the app's design. The digital wireframes allowed us to refine the app's layout and features, making it easier to visualize the final product. This digital wireframe showcases the main user flow, from discovering personalized activities to planning the next adventure with friends.",
                "src": "https://embed.figma.com/proto/Acilgp9GreVOpBfNM9fWZQ/Google-Campfy?node-id=6-412&p=f&scaling=scale-down&content-scaling=fixed&page-id=3%3A167&starting-point-node-id=3%3A169&embed-host=share"
            },
            "Wireframe": {
                "title": "Paper Wireframe",
                "description": "I started the design phase by creating paper wireframes to quickly visualize the app's layout and features. I draw five quick-sketch versions for the home screen. Then I selected the best elements from each sketch to create a final paper wireframe. These wireframes helped me communicate my ideas with the team and gather feedback before moving on to digital designs."
            }
        },
        "development": {
            "id": "development",
            "title": "Development",
            "prototype": {
                "title": "Prototype",
                "description": "I created a high-fidelity prototype to demonstrate the app's functionality and user flow. This interactive prototype showcases how users will discover personalized activities, navigate through recommendations, and effortlessly plan their next adventure. Through realistic interactions, you'll experience firsthand how Plannee transforms the frustration of endless searching into the joy of instant suggestions. ",
                
                "src": "https://embed.figma.com/proto/7LVgkk3R7G11Mk1Jawtwr8/Plannee?node-id=11-9&p=f&scaling=scale-down&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=11%3A9&embed-host=share"
            },
            "heuristic": {
                "title": "Heuristic Evaluation",
                "description": "After we conducted a heuristic evaluation, the prototype needed a little adjustment to enhance the usability and user experience of the system and make it more user-friendly.",
                "feedback": [
                    "“However, some buttons were <b>difficult</b> to initially find. For example, the “Add Post” button was not seen during the first to attempt to complete the first task. ”",
                    "“ The aesthetic of the app is <b>intuitive</b>, and <b>realistic</b>, coinciding with real-world social media applications the white, purple, and soft yellow accents work well together, creating a <b>clean</b>, and <b>welcoming</b> social media platform. ”",
                    "“ In most cases, <b>user control</b> and <b>freedom</b> were implemented well. There were multiple cases in which mistakes and incorrect navigation could be reversed easily.  ”"
                ]
            },
            "final": {
                "title": "Final Product",
                "description": " After working with my team, the final product was developed using React Native, with backend features in Java SpringBoot and a user-friendly interface designed with Tailwind CSS. The app was launched on both iOS and Android platforms. Feel free to explore the app and see the features we developed."
            }
        },
        "reflection": {
            "id": "reflection",
            "title": "Reflection",
            "lookingback": {
                "title": "Looking Back.",
                "description": "In a 4-week design:",
                "list": [
                    "I conducted a <b>competitive analysis</b> of existing activity recommendation platforms",
                    "I create two <b>personas</b> to guide design decisions",
                    "I designed a <b>style guide</b> and <b>wireframes</b>",
                    "I produced a <b>high-fidelity prototype</b>"
                ],
                "reflection": "I am proud of creating Plannee from scratch. This was my first time designing a location-based personalization platform, and balancing simplicity with functionality was challenging but rewarding. I gained a deeper understanding of designing for spontaneous use cases and creating intuitive user experiences that solve real problems."
            },
            "lookingforward": {
                "title": "Looking Forward.",
                "description": "The prototype is ready for user testing, and I hope to gather feedback to refine Plannee further. Through this project, I learned the importance of user-centered design and solving real problems rather than just creating visually appealing interfaces. What I'm most proud of is the clean, intuitive interface that makes activity discovery feel effortless. Overall, I learned to always prioritize the user, and I look forward to applying these skills to future design challenges."
            },
            "demo": {
                "title": "Demo",
                "description": "Expo day for demo the app to the client and potential users."
            }
        }
    }
}
